---
kind: method
id: M:Autodesk.Revit.DB.IFC.ExporterIFCUtils.GetWallBaseOffset(Autodesk.Revit.DB.Wall)
source: html/4a9e1f64-8297-ecbf-2147-c5d1b1b5a839.htm
---
# Autodesk.Revit.DB.IFC.ExporterIFCUtils.GetWallBaseOffset Method

Obtains the base offset of the wall.

## Syntax (C#)
```csharp
public static double GetWallBaseOffset(
	Wall wall
)
```

## Parameters
- **wall** (`Autodesk.Revit.DB.Wall`) - The wall.

## Returns
The base offset of the wall.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null